{
  "arxivId": "1802.04956",
  "title": "D2KE: From Distance to Kernel and Embedding",
  "authors": "Lingfei Wu, Ian En-Hsu Yen, Fangli Xu, Pradeep Ravikumar, Michael Witbrock",
  "abstract": "For many machine learning problem settings, particularly with structured\ninputs such as sequences or sets of objects, a distance measure between inputs\ncan be specified more naturally than a feature representation. However, most\nstandard machine models are designed for inputs with a vector feature\nrepresentation. In this work, we consider the estimation of a function\n$f:\\mathcal{X} \\rightarrow \\R$ based solely on a dissimilarity measure\n$d:\\mathcal{X}\\times\\mathcal{X} \\rightarrow \\R$ between inputs. In particular,\nwe propose a general framework to derive a family of \\emph{positive definite\nkernels} from a given dissimilarity measure, which subsumes the widely-used\n\\emph{representative-set method} as a special case, and relates to the\nwell-known \\emph{distance substitution kernel} in a limiting case. We show that\nfunctions in the corresponding Reproducing Kernel Hilbert Space (RKHS) are\nLipschitz-continuous w.r.t. the given distance metric. We provide a tractable\nalgorithm to estimate a function from this RKHS, and show that it enjoys better\ngeneralizability than Nearest-Neighbor estimates. Our approach draws from the\nliterature of Random Features, but instead of deriving feature maps from an\nexisting kernel, we construct novel kernels from a random feature map, that we\nspecify given the distance measure. We conduct classification experiments with\nsuch disparate domains as strings, time series, and sets of vectors, where our\nproposed framework compares favorably to existing distance-based learning\nmethods such as $k$-nearest-neighbors, distance-substitution kernels,\npseudo-Euclidean embedding, and the representative-set method.",
  "url": "https://arxiv.org/abs/1802.04956",
  "issue_number": 493,
  "issue_url": "https://github.com/dmarx/papers-feed/issues/493",
  "created_at": "2024-12-30T08:27:43.532109",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 0,
  "last_read": null,
  "last_visited": "2024-12-29T10:54:09.487Z",
  "main_tex_file": null,
  "published_date": "2018-02-14T04:58:13Z",
  "arxiv_tags": [
    "stat.ML",
    "cs.LG"
  ]
}