{
  "arxivId": "2410.04715",
  "title": "Rule-based Data Selection for Large Language Models",
  "authors": "Xiaomin Li, Mingye Gao, Zhiwei Zhang, Chang Yue, Hong Hu",
  "abstract": "The quality of training data significantly impacts the performance of large\nlanguage models (LLMs). There are increasing studies using LLMs to rate and\nselect data based on several human-crafted metrics (rules). However, these\nconventional rule-based approaches often depend too heavily on human\nheuristics, lack effective metrics for assessing rules, and exhibit limited\nadaptability to new tasks. In our study, we introduce an innovative rule-based\nframework that utilizes the orthogonality of score vectors associated with\nrules as a novel metric for rule evaluations. Our approach includes an\nautomated pipeline that first uses LLMs to generate a diverse set of rules,\nencompassing various rating dimensions to evaluate data quality. Then it rates\na batch of data based on these rules and uses the determinantal point process\n(DPP) from random matrix theory to select the most orthogonal score vectors,\nthereby identifying a set of independent rules. These rules are subsequently\nused to evaluate all data, selecting samples with the highest average scores\nfor downstream tasks such as LLM training. We verify the effectiveness of our\nmethod through two experimental setups: 1) comparisons with ground truth\nratings and 2) benchmarking LLMs trained with the chosen data. Our\ncomprehensive experiments cover a range of scenarios, including general\npre-training and domain-specific fine-tuning in areas such as IMDB, Medical,\nMath, and Code. The outcomes demonstrate that our DPP-based rule rating method\nconsistently outperforms other approaches, including rule-free rating, uniform\nsampling, importance resampling, and QuRating, in terms of both rating\nprecision and model performance.",
  "url": "https://arxiv.org/abs/2410.04715",
  "issue_number": 622,
  "issue_url": "https://github.com/dmarx/papers-feed/issues/622",
  "created_at": "2024-12-30T20:00:47.336892",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 21,
  "last_read": "2024-12-30T20:04:21.781140",
  "last_visited": "2024-12-30T20:01:25.636000+00:00",
  "main_tex_file": null,
  "published_date": "2024-10-07T03:13:06Z",
  "arxiv_tags": [
    "cs.CL",
    "cs.AI",
    "cs.LG"
  ]
}