{
  "arxivId": "2104.13478",
  "title": "Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges",
  "authors": "Michael M. Bronstein, Joan Bruna, Taco Cohen, Petar Veličković",
  "abstract": "The last decade has witnessed an experimental revolution in data science and\nmachine learning, epitomised by deep learning methods. Indeed, many\nhigh-dimensional learning tasks previously thought to be beyond reach -- such\nas computer vision, playing Go, or protein folding -- are in fact feasible with\nappropriate computational scale. Remarkably, the essence of deep learning is\nbuilt from two simple algorithmic principles: first, the notion of\nrepresentation or feature learning, whereby adapted, often hierarchical,\nfeatures capture the appropriate notion of regularity for each task, and\nsecond, learning by local gradient-descent type methods, typically implemented\nas backpropagation.\n  While learning generic functions in high dimensions is a cursed estimation\nproblem, most tasks of interest are not generic, and come with essential\npre-defined regularities arising from the underlying low-dimensionality and\nstructure of the physical world. This text is concerned with exposing these\nregularities through unified geometric principles that can be applied\nthroughout a wide spectrum of applications.\n  Such a 'geometric unification' endeavour, in the spirit of Felix Klein's\nErlangen Program, serves a dual purpose: on one hand, it provides a common\nmathematical framework to study the most successful neural network\narchitectures, such as CNNs, RNNs, GNNs, and Transformers. On the other hand,\nit gives a constructive procedure to incorporate prior physical knowledge into\nneural architectures and provide principled way to build future architectures\nyet to be invented.",
  "url": "https://arxiv.org/abs/2104.13478",
  "issue_number": 480,
  "issue_url": "https://github.com/dmarx/arxiv-archive/issues/480",
  "created_at": "2024-12-29T11:10:41.092515",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 15,
  "last_read": "2024-12-29T11:10:41.093321",
  "last_visited": "2024-12-29T10:38:37.304Z",
  "main_tex_file": null,
  "published_date": "2021-04-27T21:09:51Z",
  "arxiv_tags": [
    "cs.LG",
    "cs.AI",
    "cs.CG",
    "cs.CV",
    "stat.ML"
  ]
}