{
  "arxivId": "2412.09349",
  "title": "DisPose: Disentangling Pose Guidance for Controllable Human Image\n  Animation",
  "authors": "Hongxiang Li, Yaowei Li, Yuhang Yang, Junjie Cao, Zhihong Zhu, Xuxin Cheng, Long Chen",
  "abstract": "Controllable human image animation aims to generate videos from reference\nimages using driving videos. Due to the limited control signals provided by\nsparse guidance (e.g., skeleton pose), recent works have attempted to introduce\nadditional dense conditions (e.g., depth map) to ensure motion alignment.\nHowever, such strict dense guidance impairs the quality of the generated video\nwhen the body shape of the reference character differs significantly from that\nof the driving video. In this paper, we present DisPose to mine more\ngeneralizable and effective control signals without additional dense input,\nwhich disentangles the sparse skeleton pose in human image animation into\nmotion field guidance and keypoint correspondence. Specifically, we generate a\ndense motion field from a sparse motion field and the reference image, which\nprovides region-level dense guidance while maintaining the generalization of\nthe sparse pose control. We also extract diffusion features corresponding to\npose keypoints from the reference image, and then these point features are\ntransferred to the target pose to provide distinct identity information. To\nseamlessly integrate into existing models, we propose a plug-and-play hybrid\nControlNet that improves the quality and consistency of generated videos while\nfreezing the existing model parameters. Extensive qualitative and quantitative\nexperiments demonstrate the superiority of DisPose compared to current methods.\nCode:\n\\href{https://github.com/lihxxx/DisPose}{https://github.com/lihxxx/DisPose}.",
  "url": "https://arxiv.org/abs/2412.09349",
  "issue_number": 191,
  "issue_url": "https://github.com/dmarx/arxiv-archive/issues/191",
  "created_at": "2024-12-25T08:52:20.571004",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 350,
  "last_read": "2024-12-25T08:52:20.575599",
  "last_visited": "2024-12-23T21:16:01.436Z"
}