{
  "arxivId": "1201.1717",
  "title": "On the Hyperbolicity of Small-World and Tree-Like Random Graphs",
  "authors": "Wei Chen, Wenjie Fang, Guangda Hu, Michael W. Mahoney",
  "abstract": "Hyperbolicity is a property of a graph that may be viewed as being a \"soft\"\nversion of a tree, and recent empirical and theoretical work has suggested that\nmany graphs arising in Internet and related data applications have hyperbolic\nproperties. We consider Gromov's notion of \\delta-hyperbolicity, and establish\nseveral results for small-world and tree-like random graph models. First, we\nstudy the hyperbolicity of Kleinberg small-world random graphs and show that\nthe hyperbolicity of these random graphs is not significantly improved\ncomparing to graph diameter even when it greatly improves decentralized\nnavigation. Next we study a class of tree-like graphs called ringed trees that\nhave constant hyperbolicity. We show that adding random links among the leaves\nsimilar to the small-world graph constructions may easily destroy the\nhyperbolicity of the graphs, except for a class of random edges added using an\nexponentially decaying probability function based on the ring distance among\nthe leaves.\n  Our study provides one of the first significant analytical results on the\nhyperbolicity of a rich class of random graphs, which shed light on the\nrelationship between hyperbolicity and navigability of random graphs, as well\nas on the sensitivity of hyperbolic {\\delta} to noises in random graphs.",
  "url": "https://arxiv.org/abs/1201.1717",
  "issue_number": 445,
  "issue_url": "https://github.com/dmarx/papers-feed/issues/445",
  "created_at": "2024-12-30T08:28:10.543868",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 0,
  "last_read": null,
  "last_visited": "2024-12-29T01:41:46.909Z",
  "main_tex_file": null,
  "published_date": "2012-01-09T09:30:38Z",
  "arxiv_tags": [
    "cs.SI",
    "cs.DM",
    "physics.soc-ph"
  ]
}