{
  "arxivId": "2405.13954",
  "title": "What is Your Data Worth to GPT? LLM-Scale Data Valuation with Influence\n  Functions",
  "authors": "Sang Keun Choe, Hwijeen Ahn, Juhan Bae, Kewen Zhao, Minsoo Kang, Youngseog Chung, Adithya Pratapa, Willie Neiswanger, Emma Strubell, Teruko Mitamura, Jeff Schneider, Eduard Hovy, Roger Grosse, Eric Xing",
  "abstract": "Large language models (LLMs) are trained on a vast amount of human-written\ndata, but data providers often remain uncredited. In response to this issue,\ndata valuation (or data attribution), which quantifies the contribution or\nvalue of each data to the model output, has been discussed as a potential\nsolution. Nevertheless, applying existing data valuation methods to recent LLMs\nand their vast training datasets has been largely limited by prohibitive\ncompute and memory costs. In this work, we focus on influence functions, a\npopular gradient-based data valuation method, and significantly improve its\nscalability with an efficient gradient projection strategy called LoGra that\nleverages the gradient structure in backpropagation. We then provide a\ntheoretical motivation of gradient projection approaches to influence functions\nto promote trust in the data valuation process. Lastly, we lower the barrier to\nimplementing data valuation systems by introducing LogIX, a software package\nthat can transform existing training code into data valuation code with minimal\neffort. In our data valuation experiments, LoGra achieves competitive accuracy\nagainst more expensive baselines while showing up to 6,500x improvement in\nthroughput and 5x reduction in GPU memory usage when applied to\nLlama3-8B-Instruct and the 1B-token dataset.",
  "url": "https://arxiv.org/abs/2405.13954",
  "issue_number": 615,
  "issue_url": "https://github.com/dmarx/papers-feed/issues/615",
  "created_at": "2024-12-30T20:00:59.212424",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 6,
  "last_read": "2024-12-30T20:00:59.213232",
  "last_visited": "2024-12-30T19:59:31.840Z",
  "main_tex_file": null,
  "published_date": "2024-05-22T19:39:05Z",
  "arxiv_tags": [
    "cs.LG",
    "cs.AI",
    "cs.CL"
  ]
}