{
  "arxivId": "2412.17799",
  "title": "Automating the Search for Artificial Life with Foundation Models",
  "authors": "Akarsh Kumar, Chris Lu, Louis Kirsch, Yujin Tang, Kenneth O. Stanley, Phillip Isola, David Ha",
  "abstract": "With the recent Nobel Prize awarded for radical advances in protein\ndiscovery, foundation models (FMs) for exploring large combinatorial spaces\npromise to revolutionize many scientific fields. Artificial Life (ALife) has\nnot yet integrated FMs, thus presenting a major opportunity for the field to\nalleviate the historical burden of relying chiefly on manual design and\ntrial-and-error to discover the configurations of lifelike simulations. This\npaper presents, for the first time, a successful realization of this\nopportunity using vision-language FMs. The proposed approach, called Automated\nSearch for Artificial Life (ASAL), (1) finds simulations that produce target\nphenomena, (2) discovers simulations that generate temporally open-ended\nnovelty, and (3) illuminates an entire space of interestingly diverse\nsimulations. Because of the generality of FMs, ASAL works effectively across a\ndiverse range of ALife substrates including Boids, Particle Life, Game of Life,\nLenia, and Neural Cellular Automata. A major result highlighting the potential\nof this technique is the discovery of previously unseen Lenia and Boids\nlifeforms, as well as cellular automata that are open-ended like Conway's Game\nof Life. Additionally, the use of FMs allows for the quantification of\npreviously qualitative phenomena in a human-aligned way. This new paradigm\npromises to accelerate ALife research beyond what is possible through human\ningenuity alone.",
  "url": "https://arxiv.org/abs/2412.17799",
  "issue_number": 247,
  "issue_url": "https://github.com/dmarx/arxiv-archive/issues/247",
  "created_at": "2024-12-24T19:44:11.050108",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 8,
  "last_read": "2024-12-24T19:44:11.051920"
}