{
  "arxivId": "2405.15523",
  "title": "Mosaic Memory: Fuzzy Duplication in Copyright Traps for Large Language\n  Models",
  "authors": "Igor Shilov, Matthieu Meeus, Yves-Alexandre de Montjoye",
  "abstract": "The immense datasets used to develop Large Language Models (LLMs) often\ninclude copyright-protected content, typically without the content creator's\nconsent. Copyright traps have been proposed to be injected into the original\ncontent, improving content detectability in newly released LLMs. Traps,\nhowever, rely on the exact duplication of a unique text sequence, leaving them\nvulnerable to commonly deployed data deduplication techniques. We here propose\nthe generation of fuzzy copyright traps, featuring slight modifications across\nduplication. When injected in the fine-tuning data of a 1.3B LLM, we show fuzzy\ntrap sequences to be memorized nearly as well as exact duplicates.\nSpecifically, the Membership Inference Attack (MIA) ROC AUC only drops from\n0.90 to 0.87 when 4 tokens are replaced across the fuzzy duplicates. We also\nfind that selecting replacement positions to minimize the exact overlap between\nfuzzy duplicates leads to similar memorization, while making fuzzy duplicates\nhighly unlikely to be removed by any deduplication process. Lastly, we argue\nthat the fact that LLMs memorize across fuzzy duplicates challenges the study\nof LLM memorization relying on naturally occurring duplicates. Indeed, we find\nthat the commonly used training dataset, The Pile, contains significant amounts\nof fuzzy duplicates. This introduces a previously unexplored confounding factor\nin post-hoc studies of LLM memorization, and questions the effectiveness of\n(exact) data deduplication as a privacy protection technique.",
  "url": "https://arxiv.org/abs/2405.15523",
  "issue_number": 629,
  "issue_url": "https://github.com/dmarx/papers-feed/issues/629",
  "created_at": "2024-12-30T20:04:12.800454",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 0,
  "last_read": null,
  "last_visited": "2024-12-30T20:02:03.116Z",
  "main_tex_file": null,
  "published_date": "2024-05-24T13:05:05Z",
  "arxiv_tags": [
    "cs.CL",
    "cs.LG"
  ]
}