{
  "arxivId": "2210.14891",
  "title": "Broken Neural Scaling Laws",
  "authors": "Ethan Caballero, Kshitij Gupta, Irina Rish, David Krueger",
  "abstract": "We present a smoothly broken power law functional form (that we refer to as a Broken Neural Scaling Law (BNSL)) that accurately models &amp; extrapolates the scaling behaviors of deep neural networks (i.e. how the evaluation metric of interest varies as amount of compute used for training (or inference), number of model parameters, training dataset size, model input size, number of training steps, or upstream performance varies) for various architectures &amp; for each of various tasks within a large &amp; diverse set of upstream &amp; downstream tasks, in zero-shot, prompted, &amp; finetuned settings. This set includes large-scale vision, language, audio, video, diffusion, generative modeling, multimodal learning, contrastive learning, AI alignment, AI capabilities, robotics, out-of-distribution (OOD) generalization, continual learning, transfer learning, uncertainty estimation / calibration, OOD detection, adversarial robustness, distillation, sparsity, retrieval, quantization, pruning, fairness, molecules, computer programming/coding, math word problems, \"emergent phase transitions\", arithmetic, supervised learning, unsupervised/self-supervised learning, &amp; reinforcement learning (single agent &amp; multi-agent). When compared to other functional forms for neural scaling, this functional form yields extrapolations of scaling behavior that are considerably more accurate on this set. Moreover, this functional form accurately models &amp; extrapolates scaling behavior that other functional forms are incapable of expressing such as the nonmonotonic transitions present in the scaling behavior of phenomena such as double descent &amp; the delayed, sharp inflection points present in the scaling behavior of tasks such as arithmetic. Lastly, we use this functional form to glean insights about the limit of the predictability of scaling behavior. Code is available at https://github.com/ethancaballero/broken_neural_scaling_laws",
  "url": "https://arxiv.org/abs/2210.14891",
  "issue_number": 85,
  "issue_url": "https://github.com/dmarx/arxiv-archive/issues/85",
  "created_at": "2024-12-21T05:51:09Z",
  "state": "open",
  "labels": [
    "paper",
    "rating:downvote"
  ],
  "total_reading_time_minutes": 0,
  "last_read": null
}