{
  "arxivId": "2412.18168",
  "title": "From Pairwise to Ranking: Climbing the Ladder to Ideal Collaborative\n  Filtering with Pseudo-Ranking",
  "authors": "Yuhan Zhao, Rui Chen, Li Chen, Shuang Zhang, Qilong Han, Hongtao Song",
  "abstract": "Intuitively, an ideal collaborative filtering (CF) model should learn from\nusers' full rankings over all items to make optimal top-K recommendations. Due\nto the absence of such full rankings in practice, most CF models rely on\npairwise loss functions to approximate full rankings, resulting in an immense\nperformance gap. In this paper, we provide a novel analysis using the multiple\nordinal classification concept to reveal the inevitable gap between a pairwise\napproximation and the ideal case. However, bridging the gap in practice\nencounters two formidable challenges: (1) none of the real-world datasets\ncontains full ranking information; (2) there does not exist a loss function\nthat is capable of consuming ranking information. To overcome these challenges,\nwe propose a pseudo-ranking paradigm (PRP) that addresses the lack of ranking\ninformation by introducing pseudo-rankings supervised by an original noise\ninjection mechanism. Additionally, we put forward a new ranking loss function\ndesigned to handle ranking information effectively. To ensure our method's\nrobustness against potential inaccuracies in pseudo-rankings, we equip the\nranking loss function with a gradient-based confidence mechanism to detect and\nmitigate abnormal gradients. Extensive experiments on four real-world datasets\ndemonstrate that PRP significantly outperforms state-of-the-art methods.",
  "url": "https://arxiv.org/abs/2412.18168",
  "issue_number": 0,
  "issue_url": "",
  "created_at": "2024-12-30T08:26:58.544281",
  "state": "open",
  "labels": [
    "paper"
  ],
  "total_reading_time_seconds": 6,
  "last_read": "2024-12-30T08:27:02.068052",
  "last_visited": "2024-12-30T04:49:25.255000+00:00",
  "main_tex_file": null,
  "published_date": "2024-12-24T05:01:16Z",
  "arxiv_tags": [
    "cs.IR"
  ]
}