{
  "arxivId": "1803.00567",
  "title": "Computational Optimal Transport",
  "authors": "Gabriel Peyré, Marco Cuturi",
  "abstract": "Optimal transport (OT) theory can be informally described using the words of\nthe French mathematician Gaspard Monge (1746-1818): A worker with a shovel in\nhand has to move a large pile of sand lying on a construction site. The goal of\nthe worker is to erect with all that sand a target pile with a prescribed shape\n(for example, that of a giant sand castle). Naturally, the worker wishes to\nminimize her total effort, quantified for instance as the total distance or\ntime spent carrying shovelfuls of sand. Mathematicians interested in OT cast\nthat problem as that of comparing two probability distributions, two different\npiles of sand of the same volume. They consider all of the many possible ways\nto morph, transport or reshape the first pile into the second, and associate a\n\"global\" cost to every such transport, using the \"local\" consideration of how\nmuch it costs to move a grain of sand from one place to another. Recent years\nhave witnessed the spread of OT in several fields, thanks to the emergence of\napproximate solvers that can scale to sizes and dimensions that are relevant to\ndata sciences. Thanks to this newfound scalability, OT is being increasingly\nused to unlock various problems in imaging sciences (such as color or texture\nprocessing), computer vision and graphics (for shape manipulation) or machine\nlearning (for regression, classification and density fitting). This short book\nreviews OT with a bias toward numerical methods and their applications in data\nsciences, and sheds lights on the theoretical properties of OT that make it\nparticularly useful for some of these applications.",
  "url": "https://arxiv.org/abs/1803.00567",
  "issue_number": 138,
  "issue_url": "https://github.com/dmarx/arxiv-archive/issues/138",
  "created_at": "2024-12-25T08:52:35.571245",
  "state": "open",
  "labels": [
    "paper",
    "rating:novote"
  ],
  "total_reading_time_seconds": 0,
  "last_read": null,
  "last_visited": "2024-12-22T08:08:46.564Z"
}